# 导入包
import streamlit as st
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

# 设定标题
st.title("海马体体积的初步计算")

# 首先输入年龄
st.header("请在下方选择你目前的年龄🧓")
col1, col2 = st.columns(2)
year, month = None, None
with col1:
    year_number = list(range(55, 88))
    for i in range(len(year_number)):
        year_number[i] = str(year_number[i]) + "岁"
    year = st.selectbox("单位：年", year_number, index=None, placeholder="点击下拉选择")
with col2:
    month_number = list(range(12))
    for i in range(len(month_number)):
        month_number[i] = str(month_number[i]) + "月"
    month = st.selectbox("单位：月", month_number, index=None, placeholder="点击下拉选择")

# 根据不同导年龄段，进入不同的选项栏
if year is not None and month is not None:
    # 第一阶段：55年0月-69年1月
    if int(year[:-1]) in list(range(55, 69)) or (int(year[:-1]) == 69 and int(month[:-1]) <= 1):
        AGE = int(year[:-1]) + float(month[:-1]) / 12
        st.write("⚠️你选择的年龄是" + year + month)
        st.header("请填写下方相关信息📃")
        GENDER = st.selectbox("1️⃣请选择你的性别", ("男", "女"), index=None, placeholder="点击下拉选择")
        if GENDER == "男":
            GENDER = 1
        else:
            GENDER = 2
        EDUCATION = st.text_input("2️⃣请选择你的受教育程度（8年至20年）", placeholder="例：11")
        if EDUCATION.isdigit():
            EDUCATION = float(EDUCATION)
            if EDUCATION < 8 or EDUCATION > 20:
                st.write("你的输入范围应位于[8,20]，请重新输入")
        elif EDUCATION.isascii():
            items = EDUCATION.split(("."))
            if len(items) == 2 and items[0].isdigit() and items[1].isdigit():
                EDUCATION = float(EDUCATION)
            if len(items) != 2:
                st.write("你的输入不符合规范，请重新输入")
        elif EDUCATION.isdigit() == False and EDUCATION != "":
            st.write("你的输入不符合规范，请重新输入")
        DIAGNOSIS = st.selectbox("3️⃣请选择你的诊断结果", ("NL", "MCI", "DEMEMTIA"), index=None,
                                 placeholder="点击下拉选择")
        if DIAGNOSIS == "NL":
            DIAGNOSIS = 1
        elif DIAGNOSIS == "MCI":
            DIAGNOSIS = 2
        else:
            DIAGNOSIS = 3
        APGEN = st.selectbox("4️⃣请选择你的APGEN", (2, 3, 4, 5, 6), index=None, placeholder="点击下拉选择")
        CDORIENT = st.selectbox("5️⃣请选择你的CDORIENT", (0, 0.5, 1, 2), index=None, placeholder="点击下拉选择")
        GDMEMORY = st.selectbox("6️⃣请选择你的GDMEMORY", (0, 1), index=None, placeholder="点击下拉选择")
        GDTOTAL = st.selectbox("7️⃣请选择你的GDTOTAL", list(range(8)), index=None, placeholder="点击下拉选择")
        Q1SCORE_number_1 = [temp for temp in list(range(1, 9)) for i in range(3)]
        Q1SCORE_number_2 = [0, 0.33, 0.67] * 8
        Q1SCORE_number = np.array(Q1SCORE_number_1) + np.array(Q1SCORE_number_2)
        Q1SCORE = st.selectbox("8️⃣请选择你的Q1SCORE", Q1SCORE_number[:-2], index=None, placeholder="点击下拉选择")
        Q4SCORE = st.selectbox("9️⃣请选择你的Q4SCORE", list(np.arange(0, 11, 1)), index=None,
                               placeholder="点击下拉选择")
        Q8SCORE = st.selectbox("1️⃣0️⃣请选择你的Q8SCORE", list(np.arange(0, 11, 1)), index=None,
                               placeholder="点击下拉选择")
        Q11SCORE = st.selectbox("1️⃣1️⃣请选择你的Q11SCORE", list(range(4)), index=None, placeholder="点击下拉选择")
        Q13SCORE = st.selectbox("1️⃣2️⃣请选择你的Q13SCORE", list(range(6)), index=None, placeholder="点击下拉选择")
        VISSPAT4 = st.selectbox("1️⃣3️⃣请选择你的VISSPAT4", (1, 2, 3, 4, 9), index=None,
                                placeholder="点击下拉选择")
        MEMORY3 = st.selectbox("1️⃣4️⃣请选择你的MEMORY3", (1, 2, 3, 4, 9), index=None,
                               placeholder="点击下拉选择")
        LANG2 = st.selectbox("1️⃣5️⃣请选择你的LANG2", (1, 2, 3, 4, 9), index=None, placeholder="点击下拉选择")
        DIVATT1 = st.selectbox("1️⃣6️⃣请选择你的DIVATT1", (1, 2, 3, 4, 9), index=None,
                               placeholder="点击下拉选择")
        DIVATT4 = st.selectbox("1️⃣7️⃣请选择你的DIVATT4", (1, 2, 3, 4, 9), index=None,
                               placeholder="点击下拉选择")
        if GENDER != None and EDUCATION != None and DIAGNOSIS != None and APGEN != None and CDORIENT != None and GDMEMORY != None and GDTOTAL != None and Q1SCORE != None and Q4SCORE != None and Q8SCORE != None and Q11SCORE != None and Q13SCORE != None and VISSPAT4 != None and MEMORY3 != None and LANG2 != None and DIVATT1 != None and DIVATT4 != None:
            st.header("结果输出🖨️")
            INTERCEPT_coef = 3724.457
            AGE_coef = -14.796

            if GENDER == 2:
                GENDER_coef = -265.635
            else:
                GENDER_coef = 0
            EDUCATION_coef = -7.330

            if DIAGNOSIS == 2:
                DIAGNOSIS_coef = -171.177
            elif DIAGNOSIS == 3:
                DIAGNOSIS_coef = 340.242
            else:
                DIAGNOSIS_coef = 0

            if APGEN == 3:
                APGEN_coef = 188.120
            else:
                APGEN_coef = 0

            if CDORIENT == 1:
                CDORIENT_coef = -534.272
            else:
                CDORIENT_coef = 0

            if GDMEMORY == 1:
                GDMEMORY_coef = -254.921
            else:
                GDMEMORY_coef = 0

            if GDTOTAL == 4:
                GDTOTAL_coef = 404.145
            elif GDTOTAL == 3:
                GDTOTAL_coef = 323.347
            elif GDTOTAL == 2:
                GDTOTAL_coef = 205.479
            elif GDTOTAL == 1:
                GDTOTAL_coef = 108.149
            else:
                GDTOTAL_coef = 0

            if Q1SCORE == 5.33:
                Q1SCORE_coef = 444.663
            elif Q1SCORE == 5:
                Q1SCORE_coef = 146.203
            elif Q1SCORE == 3.33:
                Q1SCORE_coef = 297.443
            elif Q1SCORE == 2.33:
                Q1SCORE_coef = 192.840
            elif Q1SCORE == 5.67:
                Q1SCORE_coef = -377.258
            elif Q1SCORE == 1.67:
                Q1SCORE_coef = 313.529
            else:
                Q1SCORE_coef = 0

            if Q4SCORE == 9:
                Q4SCORE_coef = -855.968
            elif Q4SCORE == 10:
                Q4SCORE_coef = -887.173
            else:
                Q4SCORE_coef = 0

            if Q8SCORE == 4:
                Q8SCORE_coef = -90.860
            elif Q8SCORE == 1:
                Q8SCORE_coef = 163.155
            else:
                Q8SCORE_coef = 0

            if Q11SCORE == 1:
                Q11SCORE_coef = -342.146
            else:
                Q11SCORE_coef = 0

            if Q13SCORE == 3:
                Q13SCORE_coef = 456.490
            else:
                Q13SCORE_coef = 0

            if VISSPAT4 == 2:
                VISSPAT4_coef = 120.407
            else:
                VISSPAT4_coef = 0

            if MEMORY3 == 4:
                MEMORY3_coef = 169.713
            else:
                MEMORY3_coef = 0

            if LANG2 == 9:
                LANG2_coef = -201.520
            elif LANG2 == 4:
                LANG2_coef = -381.351
            else:
                LANG2_coef = 0

            if DIVATT1 == 4:
                DIVATT1_coef = 98.634
            elif DIVATT1 == 2:
                DIVATT1_coef = -121.042
            else:
                DIVATT1_coef = 0

            if DIVATT4 == 9:
                DIVATT4_coef = 405.506
            elif DIVATT4 == 2:
                DIVATT4_coef = 200.565
            else:
                DIVATT4_coef = 0

            y = INTERCEPT_coef + AGE_coef * AGE + GENDER_coef * GENDER + EDUCATION_coef * EDUCATION + DIAGNOSIS_coef * DIAGNOSIS + APGEN_coef * APGEN + CDORIENT_coef * CDORIENT + GDMEMORY_coef * GDMEMORY + GDTOTAL_coef * GDTOTAL + Q1SCORE_coef * Q1SCORE + Q4SCORE_coef * Q4SCORE + Q8SCORE_coef * Q8SCORE + Q11SCORE_coef * Q11SCORE + Q13SCORE_coef * Q13SCORE + VISSPAT4_coef * VISSPAT4 + MEMORY3_coef * MEMORY3 + LANG2_coef * LANG2 + DIVATT1_coef * DIVATT1 + DIVATT4_coef * DIVATT4
            col1, col2 = st.columns(2)
            with col1:
                st.write("基于你上方填写的信息，你的海马体体积是")
            with col2:
                st.header("🧠" + str(y)[0:9])
                CA = [2322.69, 2150.578, 1671.45, 1396.486, 2587.49, 2697.97, 2779.24, 2037.37, 2451.48, 2166.75, 1996.098,
                 2981.59, 2186.89, 2626.04, 1908.972, 2599.14, 2253.52, 2724.31, 2051.695, 2399.23, 1801.757, 2705.69,
                 2608.04, 2575.68, 1640.32, 3736.13, 2482.0, 2417.91, 1952.821, 1535.645, 2810.23, 2569.77, 1992.227,
                 2747.78, 2538.76, 2926.33, 2805.78, 2098.93, 2120.67, 2644.05, 2117.93, 1744.082, 1864.93, 2206.12,
                 1733.939, 2700.5, 2330.41, 2379.15, 1864.013, 2009.279, 2069.09, 2318.11, 2939.76, 2004.399, 2756.96,
                 2671.81, 1815.794, 2529.29, 2331.75, 2230.84, 1961.064, 2307.13, 2256.78, 2706.14, 2549.33, 1986.389,
                 2446.29, 2934.87, 2270.51, 2654.11, 1954.952, 2763.06, 2647.71, 1449.586, 2580.87, 2097.17, 2095.641,
                 2789.61, 2270.2, 2343.14, 1494.752, 1844.197, 2801.3, 2033.533, 2544.55, 2156.98, 2542.79, 2687.07,
                 2431.03, 2579.05, 2629.7, 2781.98, 2813.72, 2106.01, 2380.77, 2018.131, 2674.56, 2700.21, 2497.06,
                 3052.67, 2084.965, 2582.77, 1370.237, 2603.15, 2773.44, 1609.495, 2954.71, 3023.98, 2018.123, 2850.04,
                 2131.36, 2409.36, 3429.87, 1169.544, 1728.519, 3176.58, 3335.88, 1676.023, 1278.685, 2585.75, 2238.77,
                 2145.737, 2565.78, 1536.083, 2456.66, 1618.654, 2729.19, 1752.016, 2906.49, 2674.97, 1997.68, 2038.27,
                 2697.14, 2682.49, 2790.22, 3014.84, 2737.73, 2782.28, 2134.1, 2128.9, 3250.42, 2639.47, 2081.902,
                 1745.032, 1625.674, 3116.75, 2234.803, 2122.806, 2254.03, 2585.75, 2538.15, 2404.48, 3324.89, 2518.92,
                 2414.55, 2048.04, 2297.37, 2701.16, 1635.742, 1744.077, 2800.29, 3075.12, 2268.85, 2573.55, 2339.47,
                 2555.54, 2416.38, 2555.55, 1929.017, 1887.207, 2735.9, 2298.28, 3136.59, 2940.99, 3065.5, 2475.28,
                 1606.141, 1962.729, 3114.01, 1804.195, 1549.375, 2131.337, 2825.63, 2971.79, 2244.87, 3222.2, 1614.996,
                 2623.6, 2897.64, 2753.6, 1791.383, 2297.97, 2400.21, 2394.41, 1900.937, 1784.359, 1934.426, 2087.71,
                 3003.84, 1465.759, 2255.87, 2829.36, 2339.37, 1851.197, 2087.709, 2612.62, 2006.805, 2578.13, 2642.52,
                 2860.8, 1539.916, 2004.791, 1871.104, 2456.97, 3025.21, 2036.74, 2571.53, 2362.37, 1552.121, 2819.83,
                 2241.517, 2860.72, 2372.44, 2644.35, 2486.57, 1788.319, 2307.13, 3099.97, 2439.66, 1739.196, 3141.48,
                 2286.07, 2702.11, 2492.33, 2665.7, 2535.4, 2898.26, 2923.28, 2373.35, 2976.01, 2236.94, 2294.92,
                 2586.98, 2808.22, 1850.897, 2349.86, 2317.2, 2714.85, 1972.657, 1800.231, 2448.28, 2769.17, 2468.27,
                 2238.15, 2960.74, 2258.31, 1897.277, 1520.761, 1913.485, 2581.45, 2247.828, 2635.19, 2721.56, 2411.81,
                 2241.22, 1038.512, 2627.26, 2743.83, 3229.69, 1665.646, 2044.07, 2643.13, 2770.39, 2735.6, 2065.126,
                 2867.13, 2159.12, 2732.84, 2547.3, 2576.91, 2738.04, 2892.09, 2669.68, 2828.68, 1371.46, 1850.887,
                 2250.67, 2026.969, 2701.72, 3009.52, 3296.51, 2703.55, 1678.772, 2203.375, 1246.947, 1145.324, 2531.13,
                 2200.62, 2182.96, 2508.85, 2624.22, 2291.45, 2110.59, 2477.42, 2297.05, 2834.94, 2704.77, 1863.097,
                 2547.49, 1674.5, 2710.27, 1897.583, 2119.138, 2037.054, 2197.73, 1664.734, 2140.5, 1831.672, 2127.68,
                 1398.317, 2920.53, 2442.62, 3209.53, 2960.52, 2273.25, 1380.917, 2421.87, 2602.54, 2577.21, 3264.77,
                 2138.98, 2123.716, 1454.775, 2178.12, 1819.762, 2855.83, 1806.335, 2546.99, 1621.092, 2731.02, 3331.11,
                 1472.779, 1861.57, 2179.87, 2224.46, 2880.55, 2586.66, 1379.699, 2837.53, 1380.309, 2242.74, 1965.941,
                 2415.47, 2150.573, 1402.281, 2285.77, 1731.268, 2622.07, 1063.842, 2501.52, 2410.89, 2761.23, 1622.926,
                 2981.27, 2707.54, 1845.395, 2728.88, 2341.32, 1994.927, 1969.913, 2847.59, 3056.53, 595.092, 2430.12,
                 2587.89, 2633.66, 2709.96, 1802.051, 2692.42, 1205.443, 2432.55, 2176.51, 2262.27, 1900.94, 2417.93,
                 2247.63, 2747.18, 2070.0, 2645.58, 2102.21, 1568.07, 1498.409, 2665.71, 2925.11, 2677.32, 3061.64,
                 2769.78, 1698.0, 2604.98, 1647.644, 2554.02, 2689.82, 1930.543, 1335.144, 2661.44, 2113.34, 2441.72,
                 2265.319, 1975.405, 3080.75, 2191.47, 2611.58, 2530.82, 3131.38, 2091.365, 3716.49, 2052.2, 2008.976,
                 2891.84, 2485.63, 3121.95, 2718.08, 1111.755, 1481.016, 2893.37, 2250.37, 2762.15, 2644.96, 2672.78,
                 3109.13, 2852.17, 2697.76, 2494.2, 2900.98, 1682.74, 2711.69, 2203.13, 1922.302, 2439.41, 2879.95,
                 2305.73, 1985.775, 2480.42, 3045.35, 2897.11, 1395.572, 2605.73, 2578.62, 2832.95, 2633.97, 2612.91,
                 2930.61, 2442.42, 1804.543, 3215.44, 2630.31, 3098.45, 2303.33, 2700.2, 2544.86, 1894.831, 2299.19,
                 2987.75, 3054.2, 2665.71, 1790.557, 2331.85, 2191.92, 2542.12, 2654.42, 2705.07, 2630.49, 2313.23,
                 2776.49, 2441.09, 3099.67, 3238.84, 2088.76, 2805.48, 2527.47, 2422.49, 3042.29, 1008.91, 2807.62,
                 3021.85, 3015.39, 2710.85, 2855.23, 2875.68, 1877.582, 2692.86, 3027.79, 3085.63, 3708.81, 2036.089,
                 2294.92, 2781.37, 2294.62, 3327.33, 2259.21, 2806.52, 2427.06, 2900.39, 2499.69, 2792.05, 3208.31,
                 2495.73, 2892.15, 2300.72, 3146.67, 1764.691, 2833.25, 2555.84, 2915.04, 2111.82, 3016.36, 2436.33,
                 3441.47, 2352.9, 2825.62, 2166.29, 2904.06, 2752.53, 3060.36, 2387.89, 3020.76, 2742.61, 2914.13,
                 2930.91, 3189.4, 2324.08, 2520.45, 2609.25, 2590.94, 2880.26, 2424.62, 2749.02, 2022.094, 2586.68,
                 1586.002, 1727.337, 2861.02, 2174.38, 2701.76, 2867.47, 1513.368, 3333.14, 2279.71, 2408.14, 3248.02,
                 2499.37, 2427.92, 2516.93, 2715.5, 1892.594, 2673.03, 1320.496, 1898.497, 2519.96, 2860.72, 2735.9,
                 2770.13, 2740.75, 2633.05, 2669.68, 2394.4, 2771.3, 2883.92, 2257.63, 3107.3, 2573.14, 2661.74,
                 2558.01, 2799.08, 2977.91, 2308.97, 2612.3, 2428.89, 2132.91, 1608.275, 2383.11, 2446.97, 2904.66,
                 2486.28, 1788.022, 2568.36, 2432.86, 2111.48, 3154.86, 2535.49, 2346.8, 2318.11, 3458.56, 2406.01,
                 2395.01, 2468.26, 2696.53, 2583.92, 3244.63, 2976.08, 2430.11, 3026.2, 2529.91, 3341.98, 2557.8,
                 2651.37, 3028.26, 2645.87, 2421.606, 3177.49, 2412.0, 2745.66, 2729.58, 2556.76, 3112.8, 2683.41,
                 2509.46, 2997.14, 1897.888, 1891.584, 3552.24, 2460.03, 2821.21, 2850.04, 3058.13, 2828.67, 1555.559,
                 3024.6, 2257.15, 2856.74, 3268.21, 2619.64, 2621.77, 2215.534, 2794.71, 2580.47, 2641.8, 2545.17,
                 2837.22, 2791.85, 2503.66, 2244.77, 2506.11, 3225.41, 2752.988, 2850.61, 3126.77, 2851.26, 3319.09,
                 2054.136, 3110.35, 3118.67, 2510.58, 2982.63, 2385.06, 3108.51, 2941.28, 2716.37, 3004.85, 2966.61,
                 2855.7, 2889.71, 2758.79, 2599.31, 3221.59, 2624.82, 3386.54, 3386.83, 3160.39, 2901.07, 2405.7,
                 2385.47, 2810.97, 2933.05, 2684.15, 3091.74, 2492.38, 3026.74, 2550.46, 2734.69, 2910.02, 3343.81,
                 2438.05, 2940.3, 2567.44, 2296.14, 2585.14, 3126.84, 2708.74, 2595.82, 2874.45, 1859.436, 2611.08,
                 2593.14, 3357.24, 3036.5, 2430.72, 2633.77, 2336.93, 1430.969, 2732.55, 2209.77, 2934.57, 2085.88,
                 2386.06, 2819.29, 1805.421, 2378.13, 2728.58, 3037.11, 2755.13, 3146.5, 2564.39, 2085.796, 2694.4,
                 1658.933, 2800.59, 2604.98, 2353.64, 1610.415, 2093.5, 2591.85, 2657.78, 2774.04, 2459.41, 2431.03,
                 2906.5, 2004.162, 2857.05, 3329.17, 3129.33, 2454.83, 3039.29, 1897.586, 3164.06, 2823.49, 2742.27,
                 2802.06, 2990.81, 2713.32, 2602.54, 2573.86, 2868.82, 1835.632, 2903.9, 3494.26, 2714.85, 1167.603,
                 3694.78, 1552.418, 2539.06, 2580.88, 1629.638, 2304.37, 2031.182, 2262.57, 2242.44, 2757.26, 2210.85,
                 3619.38, 2829.29, 2285.62, 2470.4, 2969.36, 3116.14, 1954.984, 2208.24, 2843.02, 2467.69, 2912.21,
                 2342.53, 2872.92, 3006.47, 2725.8, 2258.3, 2631.84, 1949.877, 1872.307, 2222.6, 1932.377, 2216.48,
                 1776.427, 1572.263, 2632.51, 2342.61, 2879.95, 2243.55, 2765.1, 3110.36, 2432.52, 800.782, 2317.38,
                 2277.89, 2339.48, 3370.53, 2535.09, 2440.79, 2838.75, 1694.254, 2575.67, 1482.056, 2231.14, 1614.629,
                 2440.3, 2508.95, 2199.56, 2243.84, 1990.931, 2230.22, 1672.738, 1498.72, 2306.21, 2775.88, 2055.35,
                 2731.94, 2470.68, 2312.52, 2188.42, 2601.01, 2763.67, 2794.2, 1861.269, 1553.103, 3061.52, 2659.66,
                 2300.11, 2737.96, 1833.496, 2607.42, 1860.346, 2524.1, 2355.35, 2746.28, 2480.47, 2411.5, 2658.08,
                 2411.57, 2466.48, 2265.32, 2684.32, 2860.41, 1946.107, 2251.59, 2264.7, 2327.04, 2492.67, 2141.42,
                 2634.58, 1833.493, 1780.725, 1456.297, 2834.62, 2701.11]
            col1, col2 = st.columns(2)
            with col1:
                st.write("该患者在所有受试者中，海马体体积的分位数为")
            with col2:
                yy_number = sum(item <= y for item in CA)
                yy = yy_number / len(CA) * 100
                st.header("👍"+str(yy)[:5]+"%")
            fig = plt.figure()
            plt.hist(CA, bins=100,density=1,histtype="step",cumulative=1)
            plt.axvline(y)
            plt.savefig("result.jpg")
            st.image("result.jpg")
